# EDA - CUSTOMER SEGMENTATION DATASET

About the dataset:

Link: https://www.kaggle.com/datasets/muhammadhussnain09/customer-behaviour-dataset/data

Info: This dataset contains 350 customer records with a mix of numerical and categorical features. It includes demographics, spending behavior, and product preferences, making it suitable for unsupervised learning and customer segmentation tasks.

## Libraries and data

In [2]:
# Libraries

import pandas as pd

In [3]:
# Data

PATH_FILE = "/home/gustavo/repos/pandas_specialization/data/customer_segmentation_mixed.csv"
dataset = pd.read_csv(PATH_FILE)

## Inspecting dataset

In [5]:
dataset.head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
0,56,26102,85,6,Female,Clothing
1,46,70336,75,18,Male,Home
2,32,105314,36,10,Male,Groceries

In [6]:
dataset.tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
347,50,42700,77,19,Male,Clothing
348,38,54620,3,6,Female,Electronics
349,49,40559,33,2,Male,Clothing

In [8]:
dataset.info()

<class 'pandas.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Age                350 non-null    int64
 1   Annual_Income      350 non-null    int64
 2   Spending_Score     350 non-null    int64
 3   Monthly_Visits     350 non-null    int64
 4   Gender             350 non-null    str
 5   Preferred_Product  350 non-null    str
dtypes: int64(4), str(2)
memory usage: 16.5 KB

In [9]:
dataset.shape

(350, 6)

## Sorting for insights

In [12]:
dataset.sort_values("Age").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
252,18,84895,15,5,Male,Home
265,18,47192,13,19,Male,Sports
134,18,114758,51,9,Female,Electronics

In [13]:
dataset.sort_values("Age").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
51,64,70300,35,19,Female,Sports
55,64,76661,47,1,Male,Electronics
34,64,90316,60,9,Male,Sports

In [15]:
dataset.sort_values("Annual_Income").head(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
202,20,20412,21,7,Male,Groceries
236,20,20728,90,7,Male,Groceries
266,29,21062,84,17,Female,Clothing

In [16]:
dataset.sort_values("Annual_Income").tail(3)

,Age,Annual_Income,Spending_Score,Monthly_Visits,Gender,Preferred_Product
339,52,119518,47,10,Female,Clothing
18,41,119713,57,3,Male,Sports
340,58,119835,1,7,Male,Clothing